docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 16:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fast multiplication with fast fourier transforms</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">Fast multiplication with fast fourier transforms</h1>
<div id="outline-container-org27c6db0" class="outline-2">
<h2 id="org27c6db0"><span class="section-number-2">1</span> base knowlege</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0a2a980" class="outline-3">
<h3 id="org0a2a980"><span class="section-number-3">1.1</span> primitive root of unity</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgee4c034" class="outline-4">
<h4 id="orgee4c034"><span class="section-number-4">1.1.1</span> a number \(r\) is a primitive $n$th root of unity iff \(n\) is the smallest counting number for which \(r^n = 1\).</h4>
</div>
<div id="outline-container-org3f5db17" class="outline-4">
<h4 id="org3f5db17"><span class="section-number-4">1.1.2</span> <a href="https://mathworld.wolfram.com/PrimitiveRootofUnity.html">https://mathworld.wolfram.com/PrimitiveRootofUnity.html</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="source">source</span></span></h4>
</div>
</div>
<div id="outline-container-org30b4687" class="outline-3">
<h3 id="org30b4687"><span class="section-number-3">1.2</span> convolution theorem</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgb61a2e9" class="outline-4">
<h4 id="orgb61a2e9"><span class="section-number-4">1.2.1</span> 'depends fundamentally on the convolution theorem, which provides an efficient way to compute the cyclic convolution of two sequences. It states that the cyclic convolution of two vectors can be found by taking the discreate fourier transform of each of them, multiplying the resulting vectors element by element, and then taking the inverse discrete fourier transform.'</h4>
</div>
</div>
</div>
<div id="outline-container-orge131ab6" class="outline-2">
<h2 id="orge131ab6"><span class="section-number-2">2</span> sources</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc30b48d" class="outline-3">
<h3 id="orgc30b48d"><span class="section-number-3">2.1</span> <a href="http://numbers.computation.free.fr/Constants/Algorithms/fft.html">explanation of multiplication algorithm</a></h3>
</div>
<div id="outline-container-orge80094f" class="outline-3">
<h3 id="orge80094f"><span class="section-number-3">2.2</span> <a href="https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;ved=2ahUKEwjtqdjE57jvAhV_HzQIHeAwALsQFjAFegQIEhAD&amp;url=http%3A%2F%2Fwww.cs.rug.nl%2F~ando%2Fpdfs%2FAndo_Emerencia_multiplying_huge_integers_using_fourier_transforms_paper.pdf&amp;usg=AOvVaw1Sf0WR5er7An2U2vjzypZy">paper explaining the multiplication ANDO EMERENCIA (S1283936)</a></h3>
</div>
<div id="outline-container-org83d31fc" class="outline-3">
<h3 id="org83d31fc"><span class="section-number-3">2.3</span> <a href="https://medium.com/@aiswaryamathur/understanding-fast-fourier-transform-from-scratch-to-solve-polynomial-multiplication-8018d511162f">FFT Medium Blog Post</a></h3>
</div>
<div id="outline-container-org11d7e0b" class="outline-3">
<h3 id="org11d7e0b"><span class="section-number-3">2.4</span> <a href="https://en.wikipedia.org/wiki/Sch%C3%B6nhage%E2%80%93Strassen_algorithm">wikipedia on schonhage-strassen (multiplication algo)</a></h3>
</div>
</div>
<div id="outline-container-org1c199b2" class="outline-2">
<h2 id="org1c199b2"><span class="section-number-2">3</span> uses of FFT</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org916ef57" class="outline-3">
<h3 id="org916ef57"><span class="section-number-3">3.1</span> convert mixed signals into constituent sinusoids</h3>
</div>
<div id="outline-container-org96d4408" class="outline-3">
<h3 id="org96d4408"><span class="section-number-3">3.2</span> multiply polynomials using convolution theorem</h3>
</div>
<div id="outline-container-orgc466e88" class="outline-3">
<h3 id="orgc466e88"><span class="section-number-3">3.3</span> reduce matrix dimensionality</h3>
</div>
<div id="outline-container-org4dee660" class="outline-3">
<h3 id="org4dee660"><span class="section-number-3">3.4</span> audio processing (eg. bass boost, or radio denoising for eg. wifi)</h3>
</div>
<div id="outline-container-org40f4837" class="outline-3">
<h3 id="org40f4837"><span class="section-number-3">3.5</span> MRI machines? scan certain parts using different overlapping sinusoidal magnitudes of magnetic field</h3>
</div>
<div id="outline-container-orge6112ef" class="outline-3">
<h3 id="orge6112ef"><span class="section-number-3">3.6</span> microscope or astronomy image decomposition</h3>
</div>
<div id="outline-container-orgb0140aa" class="outline-3">
<h3 id="orgb0140aa"><span class="section-number-3">3.7</span> connection to Heisenberg uncertainty principle (<a href="https://www.youtube.com/watch?v=MBnnXbOM5S4">https://www.youtube.com/watch?v=MBnnXbOM5S4</a>)</h3>
<div class="outline-text-3" id="text-3-7">
</div>
<div id="outline-container-orgbe3d997" class="outline-4">
<h4 id="orgbe3d997"><span class="section-number-4">3.7.1</span> the fourier transform graph says something about correlation</h4>
<div class="outline-text-4" id="text-3-7-1">
</div>
<ol class="org-ol">
<li><a id="org357f36f"></a>eg. for a pure signal (sine 5Hz), a winding frequency of \(\xi=5.01\) will come out pretty high on the almost-fourier-transform graph, aka it is closely correlated<br /></li>
<li><a id="org6911cee"></a>since the actual fourier transform isn't divided by signal length, longer signals will lead to higher (and steeper) peaks<br /></li>
<li><a id="org4c9c8a6"></a>these steeper peaks represent more certainty, and a shorter signal means fewer cycles means the signal has less time to balance itself out means the almost-fourier-transform will have shallower and wider peak means less certainty<br /></li>
</ol>
</div>
<div id="outline-container-orga6260ab" class="outline-4">
<h4 id="orga6260ab"><span class="section-number-4">3.7.2</span> can also use the norm of the fourier transform (to capture both x and y bc complex)</h4>
</div>
<div id="outline-container-org9ec9830" class="outline-4">
<h4 id="org9ec9830"><span class="section-number-4">3.7.3</span> when using Doppler radar (in which a single pulse detects position normally and velocity using Doppler shift), this trade off the uncertainty principle shows up</h4>
<div class="outline-text-4" id="text-3-7-3">
</div>
<ol class="org-ol">
