docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.tex
% Created 2021-09-11 Sat 16:42
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Fast multiplication with fast fourier transforms}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Fast multiplication with fast fourier transforms},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{base knowlege}
\label{sec:orgab4542a}
\subsection{primitive root of unity}
\label{sec:org29f64f1}
\subsubsection{a number \(r\) is a primitive \$n\$th root of unity iff \(n\) is the smallest counting number for which \(r^n = 1\).}
\label{sec:org776e50c}
\subsubsection{\url{https://mathworld.wolfram.com/PrimitiveRootofUnity.html}\hfill{}\textsc{source}}
\label{sec:org27dee3a}
\subsection{convolution theorem}
\label{sec:org557791c}
\subsubsection{'depends fundamentally on the convolution theorem, which provides an efficient way to compute the cyclic convolution of two sequences. It states that the cyclic convolution of two vectors can be found by taking the discreate fourier transform of each of them, multiplying the resulting vectors element by element, and then taking the inverse discrete fourier transform.'}
\label{sec:org214f4bd}
\section{sources}
\label{sec:org1a1710c}
\subsection{\href{http://numbers.computation.free.fr/Constants/Algorithms/fft.html}{explanation of multiplication algorithm}}
\label{sec:orge30a960}
\subsection{\href{https://www.google.com/url?sa=t\&rct=j\&q=\&esrc=s\&source=web\&cd=\&ved=2ahUKEwjtqdjE57jvAhV\_HzQIHeAwALsQFjAFegQIEhAD\&url=http\%3A\%2F\%2Fwww.cs.rug.nl\%2F\~ando\%2Fpdfs\%2FAndo\_Emerencia\_multiplying\_huge\_integers\_using\_fourier\_transforms\_paper.pdf\&usg=AOvVaw1Sf0WR5er7An2U2vjzypZy}{paper explaining the multiplication ANDO EMERENCIA (S1283936)}}
\label{sec:org378fcf1}
\subsection{\href{https://medium.com/@aiswaryamathur/understanding-fast-fourier-transform-from-scratch-to-solve-polynomial-multiplication-8018d511162f}{FFT Medium Blog Post}}
\label{sec:orge73248c}
\subsection{\href{https://en.wikipedia.org/wiki/Sch\%C3\%B6nhage\%E2\%80\%93Strassen\_algorithm}{wikipedia on schonhage-strassen (multiplication algo)}}
\label{sec:org4731285}
\section{uses of FFT}
\label{sec:orga172ba7}
\subsection{convert mixed signals into constituent sinusoids}
\label{sec:org0a54b22}
\subsection{multiply polynomials using convolution theorem}
\label{sec:org169082d}
\subsection{reduce matrix dimensionality}
\label{sec:org3e6ba19}
\subsection{audio processing (eg. bass boost, or radio denoising for eg. wifi)}
\label{sec:orgfa8fe11}
\subsection{MRI machines? scan certain parts using different overlapping sinusoidal magnitudes of magnetic field}
\label{sec:orge9310b2}
\subsection{microscope or astronomy image decomposition}
\label{sec:org3bff47f}
\subsection{connection to Heisenberg uncertainty principle (\url{https://www.youtube.com/watch?v=MBnnXbOM5S4})}
\label{sec:orgc252b89}
\subsubsection{the fourier transform graph says something about correlation}
\label{sec:orgd7862d6}
\begin{enumerate}
\item eg. for a pure signal (sine 5Hz), a winding frequency of \(\xi=5.01\) will come out pretty high on the almost-fourier-transform graph, aka it is closely correlated
\label{sec:orgc8b004b}
\item since the actual fourier transform isn't divided by signal length, longer signals will lead to higher (and steeper) peaks
\label{sec:org08f768e}
\item these steeper peaks represent more certainty, and a shorter signal means fewer cycles means the signal has less time to balance itself out means the almost-fourier-transform will have shallower and wider peak means less certainty
\label{sec:orgd856294}
\end{enumerate}
\subsubsection{can also use the norm of the fourier transform (to capture both x and y bc complex)}
\label{sec:orgf5ceeb8}
\subsubsection{when using Doppler radar (in which a single pulse detects position normally and velocity using Doppler shift), this trade off the uncertainty principle shows up}
\label{sec:org8fc3c8a}
\begin{enumerate}
