src/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.org
**** since longer radar pulse introduce distance uncertainty and shorter radar pulses have the frequency uncertainty implied by the fourier transform as correlation above
*** particle as a wave -> relativistic doppler effect ends up having something similar
* 3b1b video [[https://www.youtube.com/watch?v=spUNpyF58BY]]
** unmixing waves
*** the added up ones seem needlessly complex for such a little amount of info
** rotating the wave around a circle
*** aka: wave around the circle is polar coords: length = magnitude of wave at that point, offset = phase + some angular velocity (the 'rotation' frequency)
*** there are two frequencies: 1. the frequency at which the vector goes around the circle 'winding frequency', and 2. the original and 'true' frequency of the wave
*** when the frequencies match, all the high points are on the right and low points are on the left... question is how can we quantify this specialness
*** center of mass as a function of the winding frequency
**** frequency of zero is high, and then it wobbles for a while until a frequency matches
** central construct
*** original plot (intensity | time)
*** winding chart (wound signal | signal, winding frequency)
*** center-of-mass plot (x coord | winding frequency)
**** the spike at zero only happens because the original freq doesn't oscillate about zero
** he calls this the 'almost Fourier transform'
*** additive: you can take the almost fourier transform first or you can take the sum first and you will get the same center-of-mass plot out
**** pause and ponder: multiple arrows going around the circle, tip to tail
** formalizing the 'center of mass'
*** complex numbers: works well for 2d plane and rotation can be described by
	\[\begin{aligned}
    e^{2\pi i t}
	\end{aligned}\]
	by multiplying that $t$ by a scalar, you can change the frequency:
	\[\begin{aligned}
    e^{2\pi i f t }
	\end{aligned}\]
*** actual formalization
**** convention: rotate in clockwise direction

	 \[\begin{aligned}
     e^{-2\pi ift}
	 \end{aligned}\]
**** let the original function be called $g(t)$, then scale by that for the 'vector following the original graph magnitude'

	 \[\begin{aligned}
     g(t) e^{-2\pi ift}
	 \end{aligned}\]
**** tracking 'center of mass': sample points and average them

	 if $N$ is the number of points that you sample and $t_k$ is the k-th sampled point,
	 \[\begin{aligned}
	\frac{1}{N}\sum_{i=1}^{N} g(t_k) e^{-2\pi i f t_k}
	 \end{aligned}\]
**** and if we want a more accurate sample, just take the limit to infinity

	 \[\begin{aligned}
    \lim_{N \to\infty }\frac{1}{N} \sum_{i=1}^{N} g(t_k) e^{-2\pi i f t_k}
	 \end{aligned}\]
**** which is really the same as taking the integral

	 \[\begin{aligned}
     \frac{1}{t_2-t_1}\int_{t_1}^{t_2} g(t) e^{-2\pi ift} dt
	 \end{aligned}\]
**** but we don't actually need to divide by the time interval
	 \[\begin{aligned}
     \int_{t_1}^{t_2} g(t) e^{-2\pi ift} dt
	 \end{aligned}\]

	 This means that when a frequency persists for a long time, it gets scaled more
* [[https://www.youtube.com/watch?v=h7apO7q16V0][Reducible on FFT]]
** intro: its important and beautiful
** start with multiplying polynomials
*** represent by list of coefficients in ascending order (index = degree of term) (polynomial representation)
*** another option: two-point representation
