docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.html
<li><a id="orgcbe3829"></a>since longer radar pulse introduce distance uncertainty and shorter radar pulses have the frequency uncertainty implied by the fourier transform as correlation above<br /></li>
</ol>
</div>
<div id="outline-container-org00341ec" class="outline-4">
<h4 id="org00341ec"><span class="section-number-4">3.7.4</span> particle as a wave -&gt; relativistic doppler effect ends up having something similar</h4>
</div>
</div>
</div>
<div id="outline-container-orgb125430" class="outline-2">
<h2 id="orgb125430"><span class="section-number-2">4</span> 3b1b video <a href="https://www.youtube.com/watch?v=spUNpyF58BY">https://www.youtube.com/watch?v=spUNpyF58BY</a></h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgde7edbc" class="outline-3">
<h3 id="orgde7edbc"><span class="section-number-3">4.1</span> unmixing waves</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org0078dc1" class="outline-4">
<h4 id="org0078dc1"><span class="section-number-4">4.1.1</span> the added up ones seem needlessly complex for such a little amount of info</h4>
</div>
</div>
<div id="outline-container-org1f4ef56" class="outline-3">
<h3 id="org1f4ef56"><span class="section-number-3">4.2</span> rotating the wave around a circle</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgb2aca0c" class="outline-4">
<h4 id="orgb2aca0c"><span class="section-number-4">4.2.1</span> aka: wave around the circle is polar coords: length = magnitude of wave at that point, offset = phase + some angular velocity (the 'rotation' frequency)</h4>
</div>
<div id="outline-container-org23fc61e" class="outline-4">
<h4 id="org23fc61e"><span class="section-number-4">4.2.2</span> there are two frequencies: 1. the frequency at which the vector goes around the circle 'winding frequency', and 2. the original and 'true' frequency of the wave</h4>
</div>
<div id="outline-container-org912ab4b" class="outline-4">
<h4 id="org912ab4b"><span class="section-number-4">4.2.3</span> when the frequencies match, all the high points are on the right and low points are on the left&#x2026; question is how can we quantify this specialness</h4>
</div>
<div id="outline-container-orge4e4124" class="outline-4">
<h4 id="orge4e4124"><span class="section-number-4">4.2.4</span> center of mass as a function of the winding frequency</h4>
<div class="outline-text-4" id="text-4-2-4">
</div>
<ol class="org-ol">
<li><a id="org6fd21d4"></a>frequency of zero is high, and then it wobbles for a while until a frequency matches<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org0f36ddc" class="outline-3">
<h3 id="org0f36ddc"><span class="section-number-3">4.3</span> central construct</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgc862e95" class="outline-4">
<h4 id="orgc862e95"><span class="section-number-4">4.3.1</span> original plot (intensity | time)</h4>
</div>
<div id="outline-container-org0a55c41" class="outline-4">
<h4 id="org0a55c41"><span class="section-number-4">4.3.2</span> winding chart (wound signal | signal, winding frequency)</h4>
</div>
<div id="outline-container-org54b7ea0" class="outline-4">
<h4 id="org54b7ea0"><span class="section-number-4">4.3.3</span> center-of-mass plot (x coord | winding frequency)</h4>
<div class="outline-text-4" id="text-4-3-3">
</div>
<ol class="org-ol">
<li><a id="org62b5d98"></a>the spike at zero only happens because the original freq doesn't oscillate about zero<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgc8f9bdd" class="outline-3">
<h3 id="orgc8f9bdd"><span class="section-number-3">4.4</span> he calls this the 'almost Fourier transform'</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org75e47ca" class="outline-4">
<h4 id="org75e47ca"><span class="section-number-4">4.4.1</span> additive: you can take the almost fourier transform first or you can take the sum first and you will get the same center-of-mass plot out</h4>
<div class="outline-text-4" id="text-4-4-1">
</div>
<ol class="org-ol">
<li><a id="orgeef04c0"></a>pause and ponder: multiple arrows going around the circle, tip to tail<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org5537c38" class="outline-3">
<h3 id="org5537c38"><span class="section-number-3">4.5</span> formalizing the 'center of mass'</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-orgb07aae4" class="outline-4">
<h4 id="orgb07aae4"><span class="section-number-4">4.5.1</span> complex numbers: works well for 2d plane and rotation can be described by</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
\[\begin{aligned}
    e^{2\pi i t}
	\end{aligned}\]
by multiplying that \(t\) by a scalar, you can change the frequency:
\[\begin{aligned}
    e^{2\pi i f t }
	\end{aligned}\]
</p>
</div>
</div>
<div id="outline-container-org75d1bb3" class="outline-4">
<h4 id="org75d1bb3"><span class="section-number-4">4.5.2</span> actual formalization</h4>
<div class="outline-text-4" id="text-4-5-2">
</div>
<ol class="org-ol">
<li><a id="org685f054"></a>convention: rotate in clockwise direction<br />
<div class="outline-text-5" id="text-4-5-2-1">
<p>
\[\begin{aligned}
     e^{-2\pi ift}
	 \end{aligned}\]
</p>
</div>
</li>
<li><a id="org39edcff"></a>let the original function be called \(g(t)\), then scale by that for the 'vector following the original graph magnitude'<br />
<div class="outline-text-5" id="text-4-5-2-2">
<p>
\[\begin{aligned}
     g(t) e^{-2\pi ift}
	 \end{aligned}\]
</p>
</div>
</li>
<li><a id="orgf3eb668"></a>tracking 'center of mass': sample points and average them<br />
<div class="outline-text-5" id="text-4-5-2-3">
<p>
if \(N\) is the number of points that you sample and \(t_k\) is the k-th sampled point,
\[\begin{aligned}
	\frac{1}{N}\sum_{i=1}^{N} g(t_k) e^{-2\pi i f t_k}
	 \end{aligned}\]
</p>
</div>
</li>
<li><a id="org0f6de81"></a>and if we want a more accurate sample, just take the limit to infinity<br />
<div class="outline-text-5" id="text-4-5-2-4">
<p>
\[\begin{aligned}
    \lim_{N \to\infty }\frac{1}{N} \sum_{i=1}^{N} g(t_k) e^{-2\pi i f t_k}
	 \end{aligned}\]
</p>
</div>
</li>
<li><a id="org079b2d7"></a>which is really the same as taking the integral<br />
<div class="outline-text-5" id="text-4-5-2-5">
<p>
\[\begin{aligned}
     \frac{1}{t_2-t_1}\int_{t_1}^{t_2} g(t) e^{-2\pi ift} dt
	 \end{aligned}\]
</p>
</div>
</li>
<li><a id="org454a9d7"></a>but we don't actually need to divide by the time interval<br />
<div class="outline-text-5" id="text-4-5-2-6">
<p>
\[\begin{aligned}
     \int_{t_1}^{t_2} g(t) e^{-2\pi ift} dt
	 \end{aligned}\]
</p>

<p>
This means that when a frequency persists for a long time, it gets scaled more
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5464dbe" class="outline-2">
<h2 id="org5464dbe"><span class="section-number-2">5</span> <a href="https://www.youtube.com/watch?v=h7apO7q16V0">Reducible on FFT</a></h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orge8e9b74" class="outline-3">
<h3 id="orge8e9b74"><span class="section-number-3">5.1</span> intro: its important and beautiful</h3>
</div>
<div id="outline-container-orgcd14cb5" class="outline-3">
<h3 id="orgcd14cb5"><span class="section-number-3">5.2</span> start with multiplying polynomials</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orga5621a8" class="outline-4">
<h4 id="orga5621a8"><span class="section-number-4">5.2.1</span> represent by list of coefficients in ascending order (index = degree of term) (polynomial representation)</h4>
</div>
<div id="outline-container-org03865c9" class="outline-4">
<h4 id="org03865c9"><span class="section-number-4">5.2.2</span> another option: two-point representation</h4>
<div class="outline-text-4" id="text-5-2-2">
</div>
<ol class="org-ol">
