docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.tex
\item since longer radar pulse introduce distance uncertainty and shorter radar pulses have the frequency uncertainty implied by the fourier transform as correlation above
\label{sec:orga1a376e}
\end{enumerate}
\subsubsection{particle as a wave -> relativistic doppler effect ends up having something similar}
\label{sec:org34054d3}
\section{3b1b video \url{https://www.youtube.com/watch?v=spUNpyF58BY}}
\label{sec:orge240231}
\subsection{unmixing waves}
\label{sec:orga23d900}
\subsubsection{the added up ones seem needlessly complex for such a little amount of info}
\label{sec:org4c84f0f}
\subsection{rotating the wave around a circle}
\label{sec:orgb3c7456}
\subsubsection{aka: wave around the circle is polar coords: length = magnitude of wave at that point, offset = phase + some angular velocity (the 'rotation' frequency)}
\label{sec:orgeeeec3e}
\subsubsection{there are two frequencies: 1. the frequency at which the vector goes around the circle 'winding frequency', and 2. the original and 'true' frequency of the wave}
\label{sec:org6b97389}
\subsubsection{when the frequencies match, all the high points are on the right and low points are on the left\ldots{} question is how can we quantify this specialness}
\label{sec:orgcea807d}
\subsubsection{center of mass as a function of the winding frequency}
\label{sec:org91dd443}
\begin{enumerate}
\item frequency of zero is high, and then it wobbles for a while until a frequency matches
\label{sec:orge58a697}
\end{enumerate}
\subsection{central construct}
\label{sec:org9b82dbf}
\subsubsection{original plot (intensity | time)}
\label{sec:orge0e41ad}
\subsubsection{winding chart (wound signal | signal, winding frequency)}
\label{sec:org6935b4e}
\subsubsection{center-of-mass plot (x coord | winding frequency)}
\label{sec:org38a23c7}
\begin{enumerate}
\item the spike at zero only happens because the original freq doesn't oscillate about zero
\label{sec:orgff4f612}
\end{enumerate}
\subsection{he calls this the 'almost Fourier transform'}
\label{sec:org01d0ce4}
\subsubsection{additive: you can take the almost fourier transform first or you can take the sum first and you will get the same center-of-mass plot out}
\label{sec:org8f9bfb9}
\begin{enumerate}
\item pause and ponder: multiple arrows going around the circle, tip to tail
\label{sec:org877628b}
\end{enumerate}
\subsection{formalizing the 'center of mass'}
\label{sec:org8cb6ff4}
\subsubsection{complex numbers: works well for 2d plane and rotation can be described by}
\label{sec:org52494cd}
\[\begin{aligned}
    e^{2\pi i t}
	\end{aligned}\]
by multiplying that \(t\) by a scalar, you can change the frequency:
\[\begin{aligned}
    e^{2\pi i f t }
	\end{aligned}\]
\subsubsection{actual formalization}
\label{sec:orgfb1d769}
\begin{enumerate}
\item convention: rotate in clockwise direction
\label{sec:org2259bb9}

\[\begin{aligned}
     e^{-2\pi ift}
	 \end{aligned}\]
\item let the original function be called \(g(t)\), then scale by that for the 'vector following the original graph magnitude'
\label{sec:orgbc7b093}

\[\begin{aligned}
     g(t) e^{-2\pi ift}
	 \end{aligned}\]
\item tracking 'center of mass': sample points and average them
\label{sec:orgd3a54b3}

if \(N\) is the number of points that you sample and \(t_k\) is the k-th sampled point,
\[\begin{aligned}
	\frac{1}{N}\sum_{i=1}^{N} g(t_k) e^{-2\pi i f t_k}
	 \end{aligned}\]
\item and if we want a more accurate sample, just take the limit to infinity
\label{sec:orgb66dc25}

\[\begin{aligned}
    \lim_{N \to\infty }\frac{1}{N} \sum_{i=1}^{N} g(t_k) e^{-2\pi i f t_k}
	 \end{aligned}\]
\item which is really the same as taking the integral
\label{sec:org10db022}

\[\begin{aligned}
     \frac{1}{t_2-t_1}\int_{t_1}^{t_2} g(t) e^{-2\pi ift} dt
	 \end{aligned}\]
\item but we don't actually need to divide by the time interval
\label{sec:org17c7112}
\[\begin{aligned}
     \int_{t_1}^{t_2} g(t) e^{-2\pi ift} dt
	 \end{aligned}\]

This means that when a frequency persists for a long time, it gets scaled more
\end{enumerate}
\section{\href{https://www.youtube.com/watch?v=h7apO7q16V0}{Reducible on FFT}}
\label{sec:org0950ab1}
\subsection{intro: its important and beautiful}
\label{sec:org2dd09d4}
\subsection{start with multiplying polynomials}
\label{sec:org6a3092f}
\subsubsection{represent by list of coefficients in ascending order (index = degree of term) (polynomial representation)}
\label{sec:orgbf1d108}
\subsubsection{another option: two-point representation}
\label{sec:org04174ac}
\begin{enumerate}
