src/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.org
**** extension: any degree $n$ polynomial can be represented by $n+1$ points uniquely
**** proof: write as a system of equations, matrixify, and we know that the matrix will be invertible
**** its a bijection, lets call it the value representation
*** now to multiply, we can just take enough points on each polynomial and multiply those points to get $d_1 + d_2 + 1$ points on the product polynomial, and then solve for the actual equation
*** only O(d) operations
*** now, we need a function take coefficients to values and values to coefficients, this box is the fast fourier transform
** forward direction: evaluation
*** naive: evaluating each point takes O(d) operations which means the total eval will be $d^2$, which is no better
*** simpler problem
**** suppose $f(x) = x^2$, then picking points that are symmetric (bc even function) means you only have to evaluate half of them
**** can also do something similar for odd functions. so when you split a general polynomial into even terms and odd terms, then we can just eval each and get double the results
*** he calls them $P_e(x^2)$ and $P_o(x^2)$, and they are polynomials of $x^2$ so deg 2?? :toexpand:
*** so now we recurse
**** now it will be $O(n \log  n)$
*** a problem: we need to choose positive/negative pairs but since the recursed ones are squared, then everything will be positive
**** how to solve this problem... work over the complex numbers!
**** now what initial points do we want to choose... an example shows that it should be $x^n = 1$ for a fourth degree polynomial
**** so we want roots of unity, for some $n \leq d+1$ and $n = 2^k$
**** how to write it:

	 \[\begin{aligned}
     \omega = e^{\frac{2\pi i}{n}}
	 \end{aligned}\]

	 Then each root of unity can be expressed as a power of $\omega$

	 evaluate P(x) at
	 \[\begin{aligned}
	 [1, \omega , \omega ^2, \ldots, \omega ^{n-1}]
	 \end{aligned}\]
**** why these
***** positive-negative paired: the point across the circle is the pair
***** when squared, the n roots of unity become the n/2 roots of unity, which still have points across the circle
*** recursion time
**** base case: n = 1 -> P(1)
**** recurse
***** split into even/odd degree terms
***** recurse to get $y_e, y_o$
***** some math ( $x_j = \omega ^j$, $-\omega ^j = \omega ^{j+\frac{n}{2}}$, $y_e[j] = P_e(\omega ^{2j}), y_o[j] = P_o(\omega ^{2j})$ ) shows $P(\omega ^j) = y_e[j] + \omega ^j y_o[j], P(\omega ^{j+\frac{n}{2}}) = y_e[j] - \omega ^j y_o[j]$
*** its clean to use $d$ is a power of two, but there are impls that can handle others also
** backward direction: interpolation
*** step back
**** evaluation was a matrix vector product, and using the $k$-th roots of unity allows us to simplify the product
**** interpolation is just the inverse of the DFT matrix
*** inverse FFT
**** given polynomial evaluated at roots of unity, get the coefficients back out
**** after inverting the matrix, you find that each corresponding $\omega$ became $\frac{1}{n}\omega^{-1}$
**** so now we define the inverse fft as just the fft but with new inputs: define $\omega = \frac{1}{n}e^{\frac{-2\pi i}{n}}$
** recap:
*** polynomial multiplication is sped in value representation
*** evaluation at +/- pairs allows splitting the computation
*** evaluation at complex $n$-th roots of unity allows proper recursion
*** backwards direction is the same thing with matrix inverse
