docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.html
<li><a id="org580b39d"></a>extension: any degree \(n\) polynomial can be represented by \(n+1\) points uniquely<br /></li>
<li><a id="orgba4bffb"></a>proof: write as a system of equations, matrixify, and we know that the matrix will be invertible<br /></li>
<li><a id="orgb33929b"></a>its a bijection, lets call it the value representation<br /></li>
</ol>
</div>
<div id="outline-container-org428c5fe" class="outline-4">
<h4 id="org428c5fe"><span class="section-number-4">5.2.3</span> now to multiply, we can just take enough points on each polynomial and multiply those points to get \(d_1 + d_2 + 1\) points on the product polynomial, and then solve for the actual equation</h4>
</div>
<div id="outline-container-org62f0c23" class="outline-4">
<h4 id="org62f0c23"><span class="section-number-4">5.2.4</span> only O(d) operations</h4>
</div>
<div id="outline-container-org928db41" class="outline-4">
<h4 id="org928db41"><span class="section-number-4">5.2.5</span> now, we need a function take coefficients to values and values to coefficients, this box is the fast fourier transform</h4>
</div>
</div>
<div id="outline-container-org8eca30e" class="outline-3">
<h3 id="org8eca30e"><span class="section-number-3">5.3</span> forward direction: evaluation</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgf4f5e63" class="outline-4">
<h4 id="orgf4f5e63"><span class="section-number-4">5.3.1</span> naive: evaluating each point takes O(d) operations which means the total eval will be \(d^2\), which is no better</h4>
</div>
<div id="outline-container-org72c603a" class="outline-4">
<h4 id="org72c603a"><span class="section-number-4">5.3.2</span> simpler problem</h4>
<div class="outline-text-4" id="text-5-3-2">
</div>
<ol class="org-ol">
<li><a id="org7c9a6eb"></a>suppose \(f(x) = x^2\), then picking points that are symmetric (bc even function) means you only have to evaluate half of them<br /></li>
<li><a id="orgd3294cf"></a>can also do something similar for odd functions. so when you split a general polynomial into even terms and odd terms, then we can just eval each and get double the results<br /></li>
</ol>
</div>
<div id="outline-container-org1248041" class="outline-4">
<h4 id="org1248041"><span class="section-number-4">5.3.3</span> he calls them \(P_e(x^2)\) and \(P_o(x^2)\), and they are polynomials of \(x^2\) so deg 2??&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span></h4>
</div>
<div id="outline-container-org0125b7a" class="outline-4">
<h4 id="org0125b7a"><span class="section-number-4">5.3.4</span> so now we recurse</h4>
<div class="outline-text-4" id="text-5-3-4">
</div>
<ol class="org-ol">
<li><a id="org954893e"></a>now it will be \(O(n \log  n)\)<br /></li>
</ol>
</div>
<div id="outline-container-orgd03fe24" class="outline-4">
<h4 id="orgd03fe24"><span class="section-number-4">5.3.5</span> a problem: we need to choose positive/negative pairs but since the recursed ones are squared, then everything will be positive</h4>
<div class="outline-text-4" id="text-5-3-5">
</div>
<ol class="org-ol">
<li><a id="orgcbe286d"></a>how to solve this problem&#x2026; work over the complex numbers!<br /></li>
<li><a id="org6955acd"></a>now what initial points do we want to choose&#x2026; an example shows that it should be \(x^n = 1\) for a fourth degree polynomial<br /></li>
<li><a id="org5cacb28"></a>so we want roots of unity, for some \(n \leq d+1\) and \(n = 2^k\)<br /></li>
<li><a id="orgac34b6a"></a>how to write it:<br />
<div class="outline-text-5" id="text-5-3-5-4">
<p>
\[\begin{aligned}
     \omega = e^{\frac{2\pi i}{n}}
	 \end{aligned}\]
</p>

<p>
Then each root of unity can be expressed as a power of \(\omega\)
</p>

<p>
evaluate P(x) at
\[\begin{aligned}
	 [1, \omega , \omega ^2, \ldots, \omega ^{n-1}]
	 \end{aligned}\]
</p>
</div>
</li>
<li><a id="orge061c8d"></a>why these<br />
<ol class="org-ol">
<li><a id="orge75801d"></a>positive-negative paired: the point across the circle is the pair<br /></li>
<li><a id="org27ff0e5"></a>when squared, the n roots of unity become the n/2 roots of unity, which still have points across the circle<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgb798e1b" class="outline-4">
<h4 id="orgb798e1b"><span class="section-number-4">5.3.6</span> recursion time</h4>
<div class="outline-text-4" id="text-5-3-6">
</div>
<ol class="org-ol">
<li><a id="orgfd29063"></a>base case: n = 1 -&gt; P(1)<br /></li>
<li><a id="org5e69fc6"></a>recurse<br />
<ol class="org-ol">
<li><a id="org694c9a3"></a>split into even/odd degree terms<br /></li>
<li><a id="org4a612f3"></a>recurse to get \(y_e, y_o\)<br /></li>
<li><a id="org68e5258"></a>some math ( \(x_j = \omega ^j\), \(-\omega ^j = \omega ^{j+\frac{n}{2}}\), \(y_e[j] = P_e(\omega ^{2j}), y_o[j] = P_o(\omega ^{2j})\) ) shows \(P(\omega ^j) = y_e[j] + \omega ^j y_o[j], P(\omega ^{j+\frac{n}{2}}) = y_e[j] - \omega ^j y_o[j]\)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orga4969af" class="outline-4">
<h4 id="orga4969af"><span class="section-number-4">5.3.7</span> its clean to use \(d\) is a power of two, but there are impls that can handle others also</h4>
</div>
</div>
<div id="outline-container-org2db5d81" class="outline-3">
<h3 id="org2db5d81"><span class="section-number-3">5.4</span> backward direction: interpolation</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org393420f" class="outline-4">
<h4 id="org393420f"><span class="section-number-4">5.4.1</span> step back</h4>
<div class="outline-text-4" id="text-5-4-1">
</div>
<ol class="org-ol">
<li><a id="org9d5c476"></a>evaluation was a matrix vector product, and using the $k$-th roots of unity allows us to simplify the product<br /></li>
<li><a id="org971fe15"></a>interpolation is just the inverse of the DFT matrix<br /></li>
</ol>
</div>
<div id="outline-container-orgc789d6e" class="outline-4">
<h4 id="orgc789d6e"><span class="section-number-4">5.4.2</span> inverse FFT</h4>
<div class="outline-text-4" id="text-5-4-2">
</div>
<ol class="org-ol">
<li><a id="org14bf7e4"></a>given polynomial evaluated at roots of unity, get the coefficients back out<br /></li>
<li><a id="orge122238"></a>after inverting the matrix, you find that each corresponding \(\omega\) became \(\frac{1}{n}\omega^{-1}\)<br /></li>
<li><a id="org098c62d"></a>so now we define the inverse fft as just the fft but with new inputs: define \(\omega = \frac{1}{n}e^{\frac{-2\pi i}{n}}\)<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org217bd53" class="outline-3">
<h3 id="org217bd53"><span class="section-number-3">5.5</span> recap:</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-org861243d" class="outline-4">
<h4 id="org861243d"><span class="section-number-4">5.5.1</span> polynomial multiplication is sped in value representation</h4>
</div>
<div id="outline-container-orgc0c4142" class="outline-4">
<h4 id="orgc0c4142"><span class="section-number-4">5.5.2</span> evaluation at +/- pairs allows splitting the computation</h4>
</div>
<div id="outline-container-org2b25f0c" class="outline-4">
<h4 id="org2b25f0c"><span class="section-number-4">5.5.3</span> evaluation at complex $n$-th roots of unity allows proper recursion</h4>
</div>
<div id="outline-container-org0016089" class="outline-4">
<h4 id="org0016089"><span class="section-number-4">5.5.4</span> backwards direction is the same thing with matrix inverse</h4>
</div>
</div>
</div>
