docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.tex
\item extension: any degree \(n\) polynomial can be represented by \(n+1\) points uniquely
\label{sec:orgeb8917a}
\item proof: write as a system of equations, matrixify, and we know that the matrix will be invertible
\label{sec:org548b862}
\item its a bijection, lets call it the value representation
\label{sec:org2cc898b}
\end{enumerate}
\subsubsection{now to multiply, we can just take enough points on each polynomial and multiply those points to get \(d_1 + d_2 + 1\) points on the product polynomial, and then solve for the actual equation}
\label{sec:orgf31387b}
\subsubsection{only O(d) operations}
\label{sec:org96a0c25}
\subsubsection{now, we need a function take coefficients to values and values to coefficients, this box is the fast fourier transform}
\label{sec:org730d4a2}
\subsection{forward direction: evaluation}
\label{sec:org6e95d2f}
\subsubsection{naive: evaluating each point takes O(d) operations which means the total eval will be \(d^2\), which is no better}
\label{sec:orgb7b4971}
\subsubsection{simpler problem}
\label{sec:org57b5c12}
\begin{enumerate}
\item suppose \(f(x) = x^2\), then picking points that are symmetric (bc even function) means you only have to evaluate half of them
\label{sec:orgeb2409a}
\item can also do something similar for odd functions. so when you split a general polynomial into even terms and odd terms, then we can just eval each and get double the results
\label{sec:org341df63}
\end{enumerate}
\subsubsection{he calls them \(P_e(x^2)\) and \(P_o(x^2)\), and they are polynomials of \(x^2\) so deg 2??\hfill{}\textsc{toexpand}}
\label{sec:orgae1dd60}
\subsubsection{so now we recurse}
\label{sec:org1b73be9}
\begin{enumerate}
\item now it will be \(O(n \log  n)\)
\label{sec:orgaa24439}
\end{enumerate}
\subsubsection{a problem: we need to choose positive/negative pairs but since the recursed ones are squared, then everything will be positive}
\label{sec:orgc57cd0b}
\begin{enumerate}
\item how to solve this problem\ldots{} work over the complex numbers!
\label{sec:orgc7234cd}
\item now what initial points do we want to choose\ldots{} an example shows that it should be \(x^n = 1\) for a fourth degree polynomial
\label{sec:org31f04a1}
\item so we want roots of unity, for some \(n \leq d+1\) and \(n = 2^k\)
\label{sec:org43ece9c}
\item how to write it:
\label{sec:org63eb025}

\[\begin{aligned}
     \omega = e^{\frac{2\pi i}{n}}
	 \end{aligned}\]

Then each root of unity can be expressed as a power of \(\omega\)

evaluate P(x) at
\[\begin{aligned}
	 [1, \omega , \omega ^2, \ldots, \omega ^{n-1}]
	 \end{aligned}\]
\item why these
\label{sec:orgaf39139}
\begin{enumerate}
\item positive-negative paired: the point across the circle is the pair
\label{sec:org3b9a9f0}
\item when squared, the n roots of unity become the n/2 roots of unity, which still have points across the circle
\label{sec:orgee81bbc}
\end{enumerate}
\end{enumerate}
\subsubsection{recursion time}
\label{sec:orgfcf0f45}
\begin{enumerate}
\item base case: n = 1 -> P(1)
\label{sec:orgbec0e2d}
\item recurse
\label{sec:org64ce430}
\begin{enumerate}
\item split into even/odd degree terms
\label{sec:org08ad56c}
\item recurse to get \(y_e, y_o\)
\label{sec:org8cae8cb}
\item some math ( \(x_j = \omega ^j\), \(-\omega ^j = \omega ^{j+\frac{n}{2}}\), \(y_e[j] = P_e(\omega ^{2j}), y_o[j] = P_o(\omega ^{2j})\) ) shows \(P(\omega ^j) = y_e[j] + \omega ^j y_o[j], P(\omega ^{j+\frac{n}{2}}) = y_e[j] - \omega ^j y_o[j]\)
\label{sec:org95a524f}
\end{enumerate}
\end{enumerate}
\subsubsection{its clean to use \(d\) is a power of two, but there are impls that can handle others also}
\label{sec:orgdd65d45}
\subsection{backward direction: interpolation}
\label{sec:orga0cf943}
\subsubsection{step back}
\label{sec:org21e4aa7}
\begin{enumerate}
\item evaluation was a matrix vector product, and using the \$k\$-th roots of unity allows us to simplify the product
\label{sec:orgb1b61c8}
\item interpolation is just the inverse of the DFT matrix
\label{sec:org37634ef}
\end{enumerate}
\subsubsection{inverse FFT}
\label{sec:org2b093d9}
\begin{enumerate}
\item given polynomial evaluated at roots of unity, get the coefficients back out
\label{sec:org5933803}
\item after inverting the matrix, you find that each corresponding \(\omega\) became \(\frac{1}{n}\omega^{-1}\)
\label{sec:org03d959f}
\item so now we define the inverse fft as just the fft but with new inputs: define \(\omega = \frac{1}{n}e^{\frac{-2\pi i}{n}}\)
\label{sec:org2ea97e4}
\end{enumerate}
\subsection{recap:}
\label{sec:orgb2e1de4}
\subsubsection{polynomial multiplication is sped in value representation}
\label{sec:orgfbe4b83}
\subsubsection{evaluation at +/- pairs allows splitting the computation}
\label{sec:org3dad419}
\subsubsection{evaluation at complex \$n\$-th roots of unity allows proper recursion}
\label{sec:orge6886d8}
\subsubsection{backwards direction is the same thing with matrix inverse}
\label{sec:org350c606}
