src/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.org
* FFT video by steve brunton
** begin with the DFT (vandermonde) matrix. naive calculation is $N^2$, since there are $N^2$ terms
** spends a bunch of time talking about $N^2$ is way worse than $N \log  N$, eg. $4KHz \times 10 sec$
** uses
*** derivatives -> partial differential equations
*** data de-noising (remove certain frequencies)
*** data analysis
*** audio/image compression <- wavelet transform
*** polynomial multiplication
** DFT video
*** discrete locations -> a vector of data $\begin{pmatrix}f_1, f_2, \ldots, f_n\end{pmatrix}$
*** what we want

	\[\begin{aligned}
	\begin{pmatrix}\hat{f}_0 \\ \hat{f}_1 \\ \hat{f}_2 \\ \vdots \\ \hat{f}_{n-1}\end{pmatrix} =
	\begin{pmatrix}&&&&&\\&&&&&\\&&&&&\\&&&&&\\&&&&&\end{pmatrix}
	\begin{pmatrix}f_0 \\ f_1\\f_2\\\vdots \\f_{n-1}\end{pmatrix}
	\end{aligned}\]

	For each $1 \leq  k \leq n$,
	\[\begin{aligned}
    \hat{f} _k =\sum_{j=0}^{n-1} f_j e^{\frac{-i 2\pi k}{n}}\\
    f _k = \frac{1}{n}\sum_{j=0}^{n-1} \hat{f} _j e^{\frac{i 2\pi k}{n}}\\
	\end{aligned}\]

	The omegas, he calls 'fundamental frequencies'
	\[\begin{aligned}
    \omega _n = e^{-2\pi \frac{i}{n}}
	\end{aligned}\]
*** now matrixify

	\[\begin{aligned}
	\begin{pmatrix}\hat{f}_1 \\ \hat{f}_2 \\ \hat{f}_3 \\ \vdots \\ \hat{f}_n\end{pmatrix} =
	\begin{pmatrix}
	1 & 1 & 1 & \cdots & 1 \\
	1 & \omega & \omega ^2 & \cdots & \omega ^{n-1}\\
	1 & \omega^2 & \omega ^4 & \cdots & \omega ^{2(n-1)}\\
	\vdots & \vdots & \vdots & \ddots & \vdots \\
	1 & \omega^{n-1} & \omega ^{2(n-1)} & \cdots & \omega ^{n(n-1)}\\
	\end{pmatrix}
	\begin{pmatrix}f_1 \\ f_2\\f_3\\\vdots \\f_n\end{pmatrix}
	\end{aligned}\]
* meeting
** more focuses while cutting back
*** linear algebra
*** additional verbal explanation for people who haven't seen 3b1b before
*** any periodic function as a /linear combination/
**** space of periodic functions
**** show its a vector space
**** show its a basis
**** simple concepts, but sophisticated context
**** talk about normal fourier transform, not just discrete
*** maybe focus on periodic functions
**** space of continouous functions is also a vector space
**** the fourier transform is classically about perodic functions
*** careful definitions
**** non-infinite period
**** what do you need to add to keep it closed under addition?
**** with finite-length sums
