docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.html
<div id="outline-container-org49828a9" class="outline-2">
<h2 id="org49828a9"><span class="section-number-2">6</span> FFT video by steve brunton</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge460a34" class="outline-3">
<h3 id="orge460a34"><span class="section-number-3">6.1</span> begin with the DFT (vandermonde) matrix. naive calculation is \(N^2\), since there are \(N^2\) terms</h3>
</div>
<div id="outline-container-orge08326c" class="outline-3">
<h3 id="orge08326c"><span class="section-number-3">6.2</span> spends a bunch of time talking about \(N^2\) is way worse than \(N \log  N\), eg. \(4KHz \times 10 sec\)</h3>
</div>
<div id="outline-container-org44e4e3d" class="outline-3">
<h3 id="org44e4e3d"><span class="section-number-3">6.3</span> uses</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org226c8cb" class="outline-4">
<h4 id="org226c8cb"><span class="section-number-4">6.3.1</span> derivatives -&gt; partial differential equations</h4>
</div>
<div id="outline-container-orgc1ced00" class="outline-4">
<h4 id="orgc1ced00"><span class="section-number-4">6.3.2</span> data de-noising (remove certain frequencies)</h4>
</div>
<div id="outline-container-org63cad2d" class="outline-4">
<h4 id="org63cad2d"><span class="section-number-4">6.3.3</span> data analysis</h4>
</div>
<div id="outline-container-org50c57ca" class="outline-4">
<h4 id="org50c57ca"><span class="section-number-4">6.3.4</span> audio/image compression &lt;- wavelet transform</h4>
</div>
<div id="outline-container-orgc3102a4" class="outline-4">
<h4 id="orgc3102a4"><span class="section-number-4">6.3.5</span> polynomial multiplication</h4>
</div>
</div>
<div id="outline-container-org6b6e393" class="outline-3">
<h3 id="org6b6e393"><span class="section-number-3">6.4</span> DFT video</h3>
<div class="outline-text-3" id="text-6-4">
</div>
<div id="outline-container-orgf4ab9eb" class="outline-4">
<h4 id="orgf4ab9eb"><span class="section-number-4">6.4.1</span> discrete locations -&gt; a vector of data \(\begin{pmatrix}f_1, f_2, \ldots, f_n\end{pmatrix}\)</h4>
</div>
<div id="outline-container-org9f2a7ce" class="outline-4">
<h4 id="org9f2a7ce"><span class="section-number-4">6.4.2</span> what we want</h4>
<div class="outline-text-4" id="text-6-4-2">
<p>
\[\begin{aligned}
</p>
\begin{pmatrix}\hat{f}_0 \\ \hat{f}_1 \\ \hat{f}_2 \\ \vdots \\ \hat{f}_{n-1}\end{pmatrix} =
\begin{pmatrix}&&&&&\\&&&&&\\&&&&&\\&&&&&\\&&&&&\end{pmatrix}
\begin{pmatrix}f_0 \\ f_1\\f_2\\\vdots \\f_{n-1}\end{pmatrix}
<p>
\end{aligned}\]
</p>

<p>
For each \(1 \leq  k \leq n\),
\[\begin{aligned}
    \hat{f} _k =\sum_{j=0}^{n-1} f_j e^{\frac{-i 2\pi k}{n}}\\
    f _k = \frac{1}{n}\sum_{j=0}^{n-1} \hat{f} _j e^{\frac{i 2\pi k}{n}}\\
	\end{aligned}\]
</p>

<p>
The omegas, he calls 'fundamental frequencies'
\[\begin{aligned}
    \omega _n = e^{-2\pi \frac{i}{n}}
	\end{aligned}\]
</p>
</div>
</div>
<div id="outline-container-orgb3c3c9c" class="outline-4">
<h4 id="orgb3c3c9c"><span class="section-number-4">6.4.3</span> now matrixify</h4>
<div class="outline-text-4" id="text-6-4-3">
<p>
\[\begin{aligned}
</p>
\begin{pmatrix}\hat{f}_1 \\ \hat{f}_2 \\ \hat{f}_3 \\ \vdots \\ \hat{f}_n\end{pmatrix} =
\begin{pmatrix}
1 & 1 & 1 & \cdots & 1 \\
1 & \omega & \omega ^2 & \cdots & \omega ^{n-1}\\
1 & \omega^2 & \omega ^4 & \cdots & \omega ^{2(n-1)}\\
\vdots & \vdots & \vdots & \ddots & \vdots \\
1 & \omega^{n-1} & \omega ^{2(n-1)} & \cdots & \omega ^{n(n-1)}\\
\end{pmatrix}
\begin{pmatrix}f_1 \\ f_2\\f_3\\\vdots \\f_n\end{pmatrix}
<p>
\end{aligned}\]
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga3cf641" class="outline-2">
<h2 id="orga3cf641"><span class="section-number-2">7</span> meeting</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd2f4c8a" class="outline-3">
<h3 id="orgd2f4c8a"><span class="section-number-3">7.1</span> more focuses while cutting back</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgd2e5bd6" class="outline-4">
<h4 id="orgd2e5bd6"><span class="section-number-4">7.1.1</span> linear algebra</h4>
</div>
<div id="outline-container-orgdb42694" class="outline-4">
<h4 id="orgdb42694"><span class="section-number-4">7.1.2</span> additional verbal explanation for people who haven't seen 3b1b before</h4>
</div>
<div id="outline-container-org6b50a00" class="outline-4">
<h4 id="org6b50a00"><span class="section-number-4">7.1.3</span> any periodic function as a <i>linear combination</i></h4>
<div class="outline-text-4" id="text-7-1-3">
</div>
<ol class="org-ol">
<li><a id="orga260da6"></a>space of periodic functions<br /></li>
<li><a id="orgc8ec308"></a>show its a vector space<br /></li>
<li><a id="orgfa4f6af"></a>show its a basis<br /></li>
<li><a id="org9bd95b9"></a>simple concepts, but sophisticated context<br /></li>
<li><a id="org6c7b78e"></a>talk about normal fourier transform, not just discrete<br /></li>
</ol>
</div>
<div id="outline-container-org79f92e7" class="outline-4">
<h4 id="org79f92e7"><span class="section-number-4">7.1.4</span> maybe focus on periodic functions</h4>
<div class="outline-text-4" id="text-7-1-4">
</div>
<ol class="org-ol">
<li><a id="orgf005bdd"></a>space of continouous functions is also a vector space<br /></li>
<li><a id="org5b59e3b"></a>the fourier transform is classically about perodic functions<br /></li>
</ol>
</div>
<div id="outline-container-org552a3ee" class="outline-4">
<h4 id="org552a3ee"><span class="section-number-4">7.1.5</span> careful definitions</h4>
<div class="outline-text-4" id="text-7-1-5">
</div>
<ol class="org-ol">
<li><a id="orgbcd8565"></a>non-infinite period<br /></li>
<li><a id="orge40fc50"></a>what do you need to add to keep it closed under addition?<br /></li>
<li><a id="orgff70467"></a>with finite-length sums<br />
<div class="outline-text-5" id="text-7-1-5-3">
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Taproot</span><span class="date">2021-09-11 Sat 16:34</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
