docs/mathematics/linear_algebra/KBe21math530floFastMultiplicationWithFFT.tex
\section{FFT video by steve brunton}
\label{sec:orgfdd6697}
\subsection{begin with the DFT (vandermonde) matrix. naive calculation is \(N^2\), since there are \(N^2\) terms}
\label{sec:orgc3b49f1}
\subsection{spends a bunch of time talking about \(N^2\) is way worse than \(N \log  N\), eg. \(4KHz \times 10 sec\)}
\label{sec:org3586bf3}
\subsection{uses}
\label{sec:org5548fbf}
\subsubsection{derivatives -> partial differential equations}
\label{sec:org65880c2}
\subsubsection{data de-noising (remove certain frequencies)}
\label{sec:orgbc3473a}
\subsubsection{data analysis}
\label{sec:org32a133c}
\subsubsection{audio/image compression <- wavelet transform}
\label{sec:org795be5c}
\subsubsection{polynomial multiplication}
\label{sec:org85bdc4d}
\subsection{DFT video}
\label{sec:org1b78d60}
\subsubsection{discrete locations -> a vector of data \(\begin{pmatrix}f_1, f_2, \ldots, f_n\end{pmatrix}\)}
\label{sec:org4ebdd25}
\subsubsection{what we want}
\label{sec:org1bc6d13}

$\backslash$[\begin{aligned}
\begin{pmatrix}\hat{f}_0 \\ \hat{f}_1 \\ \hat{f}_2 \\ \vdots \\ \hat{f}_{n-1}\end{pmatrix} =
\begin{pmatrix}&&&&&\\&&&&&\\&&&&&\\&&&&&\\&&&&&\end{pmatrix}
\begin{pmatrix}f_0 \\ f_1\\f_2\\\vdots \\f_{n-1}\end{pmatrix}
\end{aligned}$\backslash$]

For each \(1 \leq  k \leq n\),
\[\begin{aligned}
    \hat{f} _k =\sum_{j=0}^{n-1} f_j e^{\frac{-i 2\pi k}{n}}\\
    f _k = \frac{1}{n}\sum_{j=0}^{n-1} \hat{f} _j e^{\frac{i 2\pi k}{n}}\\
	\end{aligned}\]

The omegas, he calls 'fundamental frequencies'
\[\begin{aligned}
    \omega _n = e^{-2\pi \frac{i}{n}}
	\end{aligned}\]
\subsubsection{now matrixify}
\label{sec:org9fa02d7}

$\backslash$[\begin{aligned}
\begin{pmatrix}\hat{f}_1 \\ \hat{f}_2 \\ \hat{f}_3 \\ \vdots \\ \hat{f}_n\end{pmatrix} =
\begin{pmatrix}
1 & 1 & 1 & \cdots & 1 \\
1 & \omega & \omega ^2 & \cdots & \omega ^{n-1}\\
1 & \omega^2 & \omega ^4 & \cdots & \omega ^{2(n-1)}\\
\vdots & \vdots & \vdots & \ddots & \vdots \\
1 & \omega^{n-1} & \omega ^{2(n-1)} & \cdots & \omega ^{n(n-1)}\\
\end{pmatrix}
\begin{pmatrix}f_1 \\ f_2\\f_3\\\vdots \\f_n\end{pmatrix}
\end{aligned}$\backslash$]
\section{meeting}
\label{sec:orge31baae}
\subsection{more focuses while cutting back}
\label{sec:orgef0fef1}
\subsubsection{linear algebra}
\label{sec:org37fd8f7}
\subsubsection{additional verbal explanation for people who haven't seen 3b1b before}
\label{sec:org6fe146b}
\subsubsection{any periodic function as a \emph{linear combination}}
\label{sec:org57373e3}
\begin{enumerate}
\item space of periodic functions
\label{sec:org0558481}
\item show its a vector space
\label{sec:orgc38a316}
\item show its a basis
\label{sec:org7195d55}
\item simple concepts, but sophisticated context
\label{sec:orgb681682}
\item talk about normal fourier transform, not just discrete
\label{sec:orge2fe82b}
\end{enumerate}
\subsubsection{maybe focus on periodic functions}
\label{sec:org217d8d2}
\begin{enumerate}
\item space of continouous functions is also a vector space
\label{sec:orgfb081d6}
\item the fourier transform is classically about perodic functions
\label{sec:org2d8af2a}
\end{enumerate}
\subsubsection{careful definitions}
\label{sec:org080bb82}
\begin{enumerate}
\item non-infinite period
\label{sec:org47420c0}
\item what do you need to add to keep it closed under addition?
\label{sec:org8cf3eb3}
\item with finite-length sums
\label{sec:org2b16ab9}
\end{enumerate}
\end{document}
